

# Домашка цикли
# ____________________________________________________________________________________
# Задача 5
# x = [0, 5, 2, 4, 7, 1, 3, 19]
# n = 0
# for i in x:
#     if i % 2 == 0:
#         continue
#     else:
#         if i % 2 != 0:
#             n += 1
# print("Не парних чисел ", n)
#
# # Задача 5, варівнт 2
# x = [0, 5, 2, 4, 7, 1, 3, 19]
# d = [i for i in x if i % 2]
# x = len(d)
# print("Не парних чисел ", x)





 # ____________________________________________________________________________________
# Задача 1
#  Написати Python-скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7.

# z = [i for i in range(1, 101,) if i % 7 == 0]
# print(z)

# З лекції
# z = [i for i in range(7, 101, 7) if not i % 7]
# print(z)

# ____________________________________________________________________________________
# Задача 2
# Написати Python-скрипт, який обчислює за допомогою циклу факторіал числа n (n вводиться з клавіатури).


# n = int(input("Введіть число  "))
# res = 1
# for i in range()




# ____________________________________________________________________________________
# Задача 3
# Записати Python - скрипт, який виводить на екран таблицю множення на 5. Переважно друкувати
# 1 x 5 = 5, 2 x 5 = 10, а не просто 5, 10, ...



# a = 5
# for i in range(1, 11):
#     z = 0
#     while z < 1:
#         s = a * i
#         z += 1
#         print(f"{a} * {i} = {s} ")


# з Лекції
# for i in range(1, 11):
#     print(f'{i} * 5 = { i * 5 } ')
# ____________________________________________________________________________________
# # Задача 4
# Написати Python - скрипт, який виводить на екран прямокутник із '*'.Висота і ширина прямокутника
# вводяться з клавіатури.Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.


# a = int(input("Введіть висоту "))
# b = int(input("Введіть ширину "))
#
#
# res = f"{'*' * a}\n" + f"*{' ' * (b - 2)}*\n" * (a - 2) + f"{'*' * b}\n"
# print(res)

# print(f"{'*' * b}")
# for i in range(a - 2):
#     print(f"*{' ' * (b - 2)}*")
# print(f"{'*' * b}")

# ____________________________________________________________________________________
# # Задача 5
# Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.

# n = [0, 5, 2, 4, 7, 1, 3, 19]
# res = [i for i in n if i % 2]
# print(len(res))

# ____________________________________________________________________________________
# Задача 6

# Створіть список випадкових чисел (розміром 4 елементи). Створіть другий список у два рази більше першого,
# де перші 4 елементи повинні дорівнювати елементам першого списку,
# а решта елементів - подвоєним значенням початкових.

# import random
# n = [random.randint(1, 10) for _ in range(4)]
# s = []
# v = s + n
# for i in n:
#     s = i * 2
#     v.append(s)
# print(n)
# print(v)

# f = [s.append(n), i * 2 for i in s]
#  print(f)
# намагався записати в один рядок


# x =
# ____________________________________________________________________________________
# # Задача 7

# Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.

# import random
#
# b = [x for x in random.randint(7500, 12800)]
# s = sum(b)/12
#
# print(b)
# print(s)
#



# ____________________________________________________________________________________
# Задача 8

# s = 0
# x = [[1, 2, 3, 4],
#     [5, 6, 7, 8],
#     [9, 10, 11, 12],
#     [13, 14, 15, 16]]
#
# for row in x:
#     print("\t".join(map(str, row)))
#     s += sum(row)
# print(s)






# ____________________________________________________________________________________
# Задача 9

# n = int(input("Введіть довжину списку  "))
# my_list = []
# for i in range(n + 1):
#     my_list.append(i)
# print(my_list)
# print(my_list.reverse())



# _____________________________________________________________________________________
#
# Задача 10



# for n in range(2, 101):
#
#     for i in range(2, n):
#         if not n % i:
#             break
#     else:
#         print("Чсисло ", n, 'просте')



# _____________________________________________________________________________________

# Задача 11

# v_list = []
# n = int(input("n = "))
#
#
#
# spaice = 0
# for stars in range(n, 0, -2):
#     v_list.append(f"{' ' * spaice }{ '*' * stars}")
#     spaice += 1
# v_list += v_list[-2::-1]
# print("\n".join(v_list))

# ---------------------------------------------------------------------------------------------------------------



