
# Домашнє завдання 2\другий рівень

# Exercise 1._____________________________________________
# x = int(input("Введіть відємне число "))
# res = x < 0 or "Число не меньше за нуль"
# print(res)
# Exercise 2._____________________________________________

# a = int(input("Введіть число "))
# x = a <= 20 or "Число більше 20"
# print(x)



# Exercise 3._____________________________________________

# a = int(input("Введіть число  "))
# m = a == 0,"Введене число дорінює нулю!" or " Введене число не дорінює нулю!"
# print(m)
# Exercise 4._____________________________________________

# a = int(input("Введіть число  "))
# if a % 2 == 0:
#     print("Число парне ")
# elif a % 2 != 0:
#     print("Число непарне ")

# Exercise 5._____________________________________________

# a = int(input("Введіть число  "))
# b = int(input("Введіть число  "))
# c = int(input("Введіть число  "))
# s = max(a, b, c)
# print("Max is ", s)



# Домашка 3

# Exercise 1._____________________________________________

# flat_num = int(input("Введіть номер квартири  "))
# if 0 <= flat_num <= 144:
#     if flat_num % 36 == 0:
#         floor = 9
#         entrance = flat_num // 36
#     if flat_num % 36 != 0:
#         entrance = (flat_num // 36) + 1
#         floor = (flat_num % 36) // 4 + 1
#     print(f" Номер квартири {flat_num} знаходиться в під`їзді № {entrance} на {floor} поверсі.")
# else:
#     print("Квартири з таким номером немає ")

# Exercise 2._____________________________________________


# year = int(input("Ввеждіть кількість днів у році  "))
#
# if year % 4 and not year % 100 or year % 400:
#     print("Рік високосний ")
# else:
#     print("Рік не високосний ")

# Exercise 3._____________________________________________

# a = int(input("Введіть значення "))
# b = int(input("Введіть значення "))
# c = int(input("Введіть значення "))
#
# if a + b > c or b + c > a or c + a > b:
#     print("Трикутник існує ")
# else:
#     print("Трикуиник не існує ")